In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(dict(aa = [1,2,3], 
                      shape = ["a", "b", "c"], 
                      dtype = [100, 200, 300]))
df

   aa shape  dtype
0   1     a    100
1   2     b    200
2   3     c    300

In [5]:
df.aa

0    1
1    2
2    3
Name: aa, dtype: int64

In [6]:
df["aa"]

0    1
1    2
2    3
Name: aa, dtype: int64

In [7]:
df.shape

(3, 3)

In [8]:
df["shape"]

0    a
1    b
2    c
Name: shape, dtype: object

In [9]:
df.iloc[:2, ]

   aa shape  dtype
0   1     a    100
1   2     b    200

In [10]:
df.loc[:2, ]

   aa shape  dtype
0   1     a    100
1   2     b    200
2   3     c    300

In [12]:
df.columns = ["xx", "yy", "zz"]
df

   xx yy   zz
0   1  a  100
1   2  b  200
2   3  c  300

In [13]:
df = df.rename(columns={"xx":"col1", "yy":"col2"})
df

   col1 col2   zz
0     1    a  100
1     2    b  200
2     3    c  300

In [16]:
ser = pd.Series(["a", "b", "c", "b"])
ser

0    a
1    b
2    c
3    b
dtype: object

In [17]:
ser[(ser == "a") | (ser == "c")]

0    a
2    c
dtype: object

In [18]:
ser.isin(["a", "c"])

0     True
1    False
2     True
3    False
dtype: bool

In [19]:
ser[ser.isin(["a", "c"])]

0    a
2    c
dtype: object

In [20]:
ser[~ser.isin(["a", "c"])]

1    b
3    b
dtype: object

In [22]:
pd.__version__

'1.4.2'

In [21]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503

In [24]:
df["지수명"].unique()

array(['KRX 300', 'KTOP 30', 'KRX 100', 'KRX Mid 200', 'KRX 자동차',
       'KRX 반도체', 'KRX 헬스케어', 'KRX 은행', 'KRX 에너지화학', 'KRX 철강', 'KRX 방송통신',
       'KRX 건설', 'KRX 증권', 'KRX 기계장비', 'KRX 보험', 'KRX 운송', 'KRX 경기소비재',
       'KRX 필수소비재', 'KRX 미디어&엔터테인먼트', 'KRX 정보기술', 'KRX 유틸리티',
       'KRX 300 정보기술', 'KRX 300 금융', 'KRX 300 자유소비재', 'KRX 300 산업재',
       'KRX 300 헬스케어', 'KRX 300 커뮤니케이션서비스', 'KRX 300 소재', 'KRX 300 필수소비재'],
      dtype=object)

In [23]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
29,KRX 300,1916.40,15.35,0.81,1903.57,1916.40,1892.36,244040965,11708937073166,2043945386926060,20210504
58,KRX 300,1927.40,11.00,0.57,1916.50,1927.40,1904.76,341534594,13004811637843,2059578026871265,20210506
87,KRX 300,1936.40,9.00,0.47,1926.59,1942.80,1925.24,253210064,11101387594368,2070880919861705,20210507
116,KRX 300,1968.47,32.07,1.66,1938.63,1973.17,1938.63,294421965,13784089230905,2105851479694870,20210510
145,KRX 300,1936.37,-32.10,-1.63,1962.35,1962.35,1929.74,339313903,15976844135869,2075382637364310,20210511
174,KRX 300,1903.99,-32.38,-1.67,1936.18,1936.82,1891.55,352799341,17136393156387,2043316163563660,20210512
203,KRX 300,1878.46,-25.53,-1.34,1893.72,1899.65,1869.37,402046342,16819555547844,2014899605250130,20210513
232,KRX 300,1899.13,20.67,1.10,1884.85,1905.26,1884.85,229722051,11413338490975,2038805937109210,20210514
261,KRX 300,1891.72,-7.41,-0.39,1906.35,1912.03,1882.03,258826078,11333749894174,2027913472817160,20210517
290,KRX 300,1913.67,21.95,1.16,1892.13,1917.43,1892.13,248484463,11503457331908,2053066878361790,20210518
319,KRX 300,1906.26,-7.41,-0.39,1914.61,1914.61,1894.97,224240546,10906767355146,2047273506168110,20210520
348,KRX 300,1907.38,1.12,0.06,1912.44,1932.91,1902.03,247944350,12200080796814,2042477090377600,20210521
377,KRX 300,1897.69,-9.69,-0.51,1906.60,1910.68,1893.57,210439901,9568918143070,2035955475360540,20210524
406,KRX 300,1915.26,17.57,0.93,1903.17,1916.85,1900.82,208362193,9591985036024,2054548999380540,20210525
435,KRX 300,1911.68,-3.58,-0.19,1915.76,1922.77,1907.37,257307289,10837464472787,2051152192863740,20210526
464,KRX 300,1910.09,-1.59,-0.08,1913.55,1915.55,1894.84,327607567,17156385452981,2043966667110420,20210527
493,KRX 300,1922.87,12.78,0.67,1913.77,1929.84,1912.48,234219802,10813228145679,2058019926179550,20210528
522,KRX 300,1932.64,9.77,0.51,1924.63,1933.75,1916.75,278319769,11293303810625,2068979877957040,20210531

In [25]:
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [26]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]] # 최대값이 하나일 때

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [29]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [30]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [31]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  5 non-null      float64
 1   Sepal.Width   4 non-null      float64
 2   Petal.Length  4 non-null      float64
 3   Petal.Width   5 non-null      float64
 4   Species       5 non-null      object
dtypes: float64(4), object(1)
memory usage: 328.0+ bytes

In [32]:
df_sub.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [33]:
df_sub.count()

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [34]:
df_sub["Sepal.Width"].isna()

0     True
1    False
2    False
3    False
4    False
Name: Sepal.Width, dtype: bool

In [35]:
df_sub["Sepal.Width"].isna().sum()

1

In [36]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [37]:
df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(-1)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
df_sub

C:\Users\GODIMODE\AppData\Local\Temp\ipykernel_14516\1071483034.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(-1)
C:\Users\GODIMODE\AppData\Local\Temp\ipykernel_14516\1071483034.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1         -1.0           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [38]:
df.isna().sum()

Sepal.Length     7
Sepal.Width     13
Petal.Length    14
Petal.Width      6
Species          0
dtype: int64

In [39]:
df_notna = df.dropna()
len(df), len(df_notna)

(150, 126)

In [40]:
df_sub1 = df.loc[df["Sepal.Width"].notna(), ]
df_sub1.isna().sum()

Sepal.Length    4
Sepal.Width     0
Petal.Length    8
Petal.Width     3
Species         0
dtype: int64

In [41]:
df_sub2 = df.dropna().reset_index(drop=True)
df_sub2["new1"] = 11
df_sub2

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species  new1
0             4.9          3.0           1.4          0.2     setosa    11
1             4.7          3.2           1.3          0.2     setosa    11
2             4.6          3.1           1.5          0.2     setosa    11
3             5.0          3.6           1.4          0.2     setosa    11
4             5.4          3.9           1.7          0.4     setosa    11
..            ...          ...           ...          ...        ...   ...
121           6.8          3.2           5.9          2.3  virginica    11
122           6.7          3.3           5.7          2.5  virginica    11
123           6.7          3.0           5.2          2.3  virginica    11
124           6.5          3.0           5.2          2.0  virginica    11
125           6.2          3.4           5.4          2.3  virginica    11

[126 rows x 6 columns]

In [42]:
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [43]:
# Species 행을 첫 행으로 옮길 때
df_sub4 = df.iloc[:, [4, 0, 1, 2, 3]]
df_sub4.head(2)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2
1  setosa           4.9          3.0           1.4          0.2

In [44]:
import numpy as np
df_sub5 = df.iloc[:, np.r_[4, 0:4]]
df_sub5.head(1)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2

In [45]:
df_sub6 = df.set_index("Species").reset_index()
df_sub6.head(1)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          NaN           NaN          0.2

In [46]:
df_sub7 = df_sub6.set_index("Sepal.Length").reset_index()
df_sub7.head(1)

   Sepal.Length Species  Sepal.Width  Petal.Length  Petal.Width
0           5.1  setosa          NaN           NaN          0.2

In [47]:
df.xs(3)

Sepal.Length       4.6
Sepal.Width        3.1
Petal.Length       1.5
Petal.Width        0.2
Species         setosa
Name: 3, dtype: object

In [49]:
ser = pd.Series([100, 200, 300])
ser

0    100
1    200
2    300
dtype: int64

In [50]:
# ser + "원"
ser.astype("str") + "원"

0    100원
1    200원
2    300원
dtype: object

In [51]:
df = pd.read_csv("bike.csv")
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [53]:
df_sub = df.loc[:4999, ["temp", "humidity", "casual"]].copy()
df_sub.iloc[[1, 3, 5, 20], 2] = np.nan
df_sub.head()

   temp  humidity  casual
0  9.84        81     3.0
1  9.02        80     NaN
2  9.02        80     5.0
3  9.84        75     NaN
4  9.84        75     0.0

In [54]:
df_train = df_sub.loc[df_sub["casual"].notna(), ]
df_test = df_sub.loc[df_sub["casual"].isna(), ]
len(df_train), len(df_test)

(4996, 4)

In [2]:
from sklearn.neighbors import KNeighborsRegressor

In [1]:
model = KNeighborsRegressor(n_neighbors=5)
model.fit(X = df_train.drop(columns = "casual"), 
         y = df_train["casual"])
pred = model.predict(df_test.drop(columns = "casual"))
pred

NameError: name 'KNeighborsRegressor' is not defined

In [58]:
df_test

     temp  humidity  casual
1    9.02        80     NaN
3    9.84        75     NaN
5    9.84        75     NaN
20  16.40        87     NaN

In [59]:
df_test["casual"] = pred
df_test

C:\Users\GODIMODE\AppData\Local\Temp\ipykernel_14516\4176358974.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_test["casual"] = pred

     temp  humidity  casual
1    9.02        80     1.6
3    9.84        75     3.0
5    9.84        75     3.0
20  16.40        87    35.2

In [60]:
df_con = pd.concat([df_train, df_test])
df_con.tail()

       temp  humidity  casual
4999  11.48        81    12.0
1      9.02        80     1.6
3      9.84        75     3.0
5      9.84        75     3.0
20    16.40        87    35.2

In [61]:
df_con.head()

   temp  humidity  casual
0  9.84        81     3.0
2  9.02        80     5.0
4  9.84        75     0.0
6  9.02        80     2.0
7  8.20        86     1.0

In [62]:
df_con = df_con.sort_index()
df_con.head()

   temp  humidity  casual
0  9.84        81     3.0
1  9.02        80     1.6
2  9.02        80     5.0
3  9.84        75     3.0
4  9.84        75     0.0

In [64]:
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [65]:
df["season"].unique()

array([1, 2, 3, 4], dtype=int64)

In [67]:
len(df["season"].unique()), df["season"].nunique()

(4, 4)

In [68]:
df["season"].value_counts()

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [69]:
df["season"].value_counts(normalize=True)

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [71]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [72]:
df_sub = df.loc[(df["season"] == 1) & (df["holiday"] == 0), ]
len(df_sub)

2615

In [73]:
sum((df["season"] == 1) & (df["holiday"] == 0))

2615

In [74]:
sum(df["season"] == 1 & df["holiday"] == 0)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [75]:
pd.crosstab(df["season"], df["holiday"], values=df["count"],
           aggfunc="mean")

holiday           0           1
season
1        117.494837   73.929577
2        215.562756  197.833333
3        234.293136  237.822917
4        198.560273  210.750000

In [76]:
dia = pd.read_csv("diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [77]:
dia.groupby("cut")["price"].mean()

cut
Fair         4358.757764
Good         3928.864452
Ideal        3457.541970
Premium      4584.257704
Very Good    3981.759891
Name: price, dtype: float64

In [80]:
dia.groupby("cut")["price"].mean().reset_index()

         cut        price
0       Fair  4358.757764
1       Good  3928.864452
2      Ideal  3457.541970
3    Premium  4584.257704
4  Very Good  3981.759891

In [81]:
dia.groupby(["cut", "color"])["price"].mean().reset_index()

          cut color        price
0        Fair     D  4291.061350
1        Fair     E  3682.312500
2        Fair     F  3827.003205
3        Fair     G  4239.254777
4        Fair     H  5135.683168
5        Fair     I  4685.445714
6        Fair     J  4975.655462
7        Good     D  3405.382175
8        Good     E  3423.644159
9        Good     F  3495.750275
10       Good     G  4123.482204
11       Good     H  4276.254986
12       Good     I  5078.532567
13       Good     J  4574.172638
14      Ideal     D  2629.094566
15      Ideal     E  2597.550090
16      Ideal     F  3374.939362
17      Ideal     G  3720.706388
18      Ideal     H  3889.334831
19      Ideal     I  4451.970377
20      Ideal     J  4918.186384
21    Premium     D  3631.292576
22    Premium     E  3538.914420
23    Premium     F  4324.890176
24    Premium     G  4500.742134
25    Premium     H  5216.706780
26    Premium     I  5946.180672
27    Premium     J  6294.591584
28  Very Good     D  3470.467284
29  Very Good     E  3214.652083
30  Very Good     F  3778.820240
31  Very Good     G  3872.753806
32  Very Good     H  4535.390351
33  Very Good     I  5255.879568
34  Very Good     J  5103.513274

In [82]:
dia.groupby("cut")[["price", "table"]].mean().reset_index()

         cut        price      table
0       Fair  4358.757764  59.053789
1       Good  3928.864452  58.694639
2      Ideal  3457.541970  55.951668
3    Premium  4584.257704  58.746095
4  Very Good  3981.759891  57.956150

In [83]:
dia.groupby("cut")["price"].agg(lambda x: round(x.mean(), 1)).reset_index()

         cut   price
0       Fair  4358.8
1       Good  3928.9
2      Ideal  3457.5
3    Premium  4584.3
4  Very Good  3981.8

In [85]:
dia.groupby("cut")["price"].agg(["max", "min"])

             max  min
cut
Fair       18574  337
Good       18788  327
Ideal      18806  326
Premium    18823  326
Very Good  18818  336

In [4]:
df = pd.read_csv("bike.csv")
df = df[["datetime", "temp"]].copy()
df.head(2)

              datetime  temp
0  2011-01-01 00:00:00  9.84
1  2011-01-01 01:00:00  9.02

In [5]:
df["datetime"] = pd.to_datetime(df["datetime"])
df.head()

             datetime  temp
0 2011-01-01 00:00:00  9.84
1 2011-01-01 01:00:00  9.02
2 2011-01-01 02:00:00  9.02
3 2011-01-01 03:00:00  9.84
4 2011-01-01 04:00:00  9.84

In [10]:
df["year"] = df["datetime"].dt.year
df["month"] = df["datetime"].dt.month
df["day"] = df["datetime"].dt.day
df["hour"] = df["datetime"].dt.hour
df["minute"] = df["datetime"].dt.minute
df["second"] = df["datetime"].dt.second
df["date"] = df["datetime"].dt.date
df.head()

,datetime,temp,year,date,month,day,hour,minute,second
0,2011-01-01 00:00:00,9.84,2011,2011-01-01,1,1,0,0,0
1,2011-01-01 01:00:00,9.02,2011,2011-01-01,1,1,1,0,0
2,2011-01-01 02:00:00,9.02,2011,2011-01-01,1,1,2,0,0
3,2011-01-01 03:00:00,9.84,2011,2011-01-01,1,1,3,0,0
4,2011-01-01 04:00:00,9.84,2011,2011-01-01,1,1,4,0,0

In [11]:
df.dtypes

datetime    datetime64[ns]
temp               float64
year                 int64
date                object
month                int64
day                  int64
hour                 int64
minute               int64
second               int64
dtype: object

In [90]:
df_agg = df.groupby("date")["temp"].max().reset_index()
df = df.merge(df_agg, on = "date")
df.head()

             datetime  temp_x        date  temp_y
0 2011-01-01 00:00:00    9.84  2011-01-01   18.86
1 2011-01-01 01:00:00    9.02  2011-01-01   18.86
2 2011-01-01 02:00:00    9.02  2011-01-01   18.86
3 2011-01-01 03:00:00    9.84  2011-01-01   18.86
4 2011-01-01 04:00:00    9.84  2011-01-01   18.86

In [91]:
df["temp_diff"] = df["temp_y"] - df["temp_x"]
df.head(2)

             datetime  temp_x        date  temp_y  temp_diff
0 2011-01-01 00:00:00    9.84  2011-01-01   18.86       9.02
1 2011-01-01 01:00:00    9.02  2011-01-01   18.86       9.84

In [92]:
df1 = pd.DataFrame(dict(col1 = [1,2,3], 
                       col2 = ["AAA", "A", "AB"]))
df1

   col1 col2
0     1  AAA
1     2    A
2     3   AB

In [93]:
df1["col3"] = df1["col2"].replace("A", "X")
df1["col4"] = df1["col2"].replace("A", "")
df1["col5"] = df1["col2"].str.replace("A", "X")
df1["col6"] = df1["col2"].str.replace("A", "")
df1

   col1 col2 col3 col4 col5 col6
0     1  AAA  AAA  AAA  XXX
1     2    A    X         X
2     3   AB   AB   AB   XB    B

In [95]:
# contains 꼭 필요함!!
df1["col2"].str.contains("B")
df1["col2"].str.contains("B").sum()

1

In [96]:
df1.loc[df1["col2"].str.contains("B"), ]

   col1 col2 col3 col4 col5 col6
2     3   AB   AB   AB   XB    B

In [97]:
df1.loc[df1["col2"].str.contains("A$"), ] # A 로 끝나는 ~

   col1 col2 col3 col4 col5 col6
0     1  AAA  AAA  AAA  XXX
1     2    A    X         X

In [99]:
df1.loc[df1["col2"].str.contains("A^"), ]

Empty DataFrame
Columns: [col1, col2, col3, col4, col5, col6]
Index: []

In [100]:
df["year1"] = df["datetime"].dt.year
df["year2"] = df["datetime"].astype("str").str.slice(0, 4)
df.head(2)

             datetime  temp_x        date  temp_y  temp_diff  year1 year2
0 2011-01-01 00:00:00    9.84  2011-01-01   18.86       9.02   2011  2011
1 2011-01-01 01:00:00    9.02  2011-01-01   18.86       9.84   2011  2011

In [101]:
df2 = pd.DataFrame(dict(col1 = [1,2,3], 
                       col2 = ["aa-bb-cc", "aa", "bb-cc"]))
df2

   col1      col2
0     1  aa-bb-cc
1     2        aa
2     3     bb-cc

In [102]:
df2["col2"].str.split("-")

0    [aa, bb, cc]
1            [aa]
2        [bb, cc]
Name: col2, dtype: object

In [103]:
df2["col2"].str.split("-", expand = True)

    0     1     2
0  aa    bb    cc
1  aa  None  None
2  bb    cc  None

In [104]:
df2["col2"].str.split("-", expand = True).fillna("")

    0   1   2
0  aa  bb  cc
1  aa
2  bb  cc

In [105]:
pd.to_datetime([1,2,3], origin="2023-03-08")

DatetimeIndex(['2023-03-08 00:00:00.000000001',
               '2023-03-08 00:00:00.000000002',
               '2023-03-08 00:00:00.000000003'],
              dtype='datetime64[ns]', freq=None)

In [107]:
pd.to_datetime([0,1,2,3], origin="2023-03-08", unit="D")

DatetimeIndex(['2023-03-08', '2023-03-09', '2023-03-10', '2023-03-11'], dtype='datetime64[ns]', freq=None)

In [114]:
dt_time = pd.DataFrame(dict(obs = [1,2,3], 
                           timestamp=["2023-03-08 09:00:00.100", "2023-03-08 09:00:00.123", "2023-03-08 09:00:00.202"]))

In [115]:
dt_time["datetime"] = pd.to_datetime(dt_time["timestamp"], 
                                    origin="2023-03-08 09:00:00", unit = "ms")
dt_time

ValueError: '0    2023-03-08 09:00:00.100
1    2023-03-08 09:00:00.123
2    2023-03-08 09:00:00.202
Name: timestamp, dtype: object' is not compatible with origin='2023-03-08 09:00:00'; it must be numeric with a unit specified

In [109]:
df_time["year"] = df_time["datetime"].dt.year
df_time["month"] = df_time["datetime"].dt.month
df_time["weekday"] = df_time["datetime"].dt.weekday

NameError: name 'df_time' is not defined

In [113]:
df_agg2 = df_agg.head().copy()
df_agg2

         date   temp
0  2011-01-01  18.86
1  2011-01-02  18.86
2  2011-01-03  10.66
3  2011-01-04  12.30
4  2011-01-05  12.30

In [118]:
df_agg2["temp_s1"] = df_agg2["temp"].shift(1)
df_agg2["temp_s2"] = df_agg2["temp"].shift(2)
df_agg2["temp_sn1"] = df_agg2["temp"].shift(-1)
df_agg2

         date   temp  temp_s1  temp_s2  temp_sn1
0  2011-01-01  18.86      NaN      NaN     18.86
1  2011-01-02  18.86    18.86      NaN     10.66
2  2011-01-03  10.66    18.86    18.86     12.30
3  2011-01-04  12.30    10.66    18.86     12.30
4  2011-01-05  12.30    12.30    10.66       NaN

In [119]:
df_agg2["diff"] = df_agg2["temp"] - df_agg2["temp_s1"]
df_agg2

         date   temp  temp_s1  temp_s2  temp_sn1  diff
0  2011-01-01  18.86      NaN      NaN     18.86   NaN
1  2011-01-02  18.86    18.86      NaN     10.66  0.00
2  2011-01-03  10.66    18.86    18.86     12.30 -8.20
3  2011-01-04  12.30    10.66    18.86     12.30  1.64
4  2011-01-05  12.30    12.30    10.66       NaN  0.00

In [134]:
df_elec = pd.read_csv("elec_load_2017_7d.csv")
df_elec.head(2)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330
1,2017,1,2,57067,55148,53983,53571,54027,55388,57753,...,72228,71945,72641,73387,72294,69989,67893,66504,67435,69275

In [135]:
df_elec_melt = df_elec.melt(id_vars=["YEAR", "MONTH", "DAY"],  # 이해안됨
                            var_name="hour", value_name="load")
df_elec_melt.head()

   YEAR  MONTH  DAY  hour   load
0  2017      1    1  X1HR  60178
1  2017      1    2  X1HR  57067
2  2017      1    3  X1HR  66263
3  2017      1    4  X1HR  68403
4  2017      1    5  X1HR  68053

In [136]:
df_elec_melt["hour"] = df_elec_melt["hour"].str.replace("X|HR", "", regex=True)
df_elec_melt["hour"] = df_elec_melt["hour"].astype("int")
df_elec_melt.head()

   YEAR  MONTH  DAY  hour   load
0  2017      1    1     1  60178
1  2017      1    2     1  57067
2  2017      1    3     1  66263
3  2017      1    4     1  68403
4  2017      1    5     1  68053

In [138]:
df_elec_melt.pivot(index=["YEAR", "MONTH", "DAY"], columns = "hour",
                  values="load")

hour               1      2      3      4      5      6      7      8      9   \
YEAR MONTH DAY
2017 1     1    60178  57862  56165  55135  54450  54401  54147  52467  50469
           2    57067  55148  53983  53571  54027  55388  57753  60781  66494
           3    66263  64233  63194  62461  62649  63396  65098  67745  72982
           4    68403  66143  65051  64245  64152  64678  66494  68851  73835
           5    68053  65801  64439  63437  63135  63250  63658  63441  65640
           6    64147  62010  60783  59779  59398  59296  58984  57533  56159
           7    60754  58974  57845  57387  57749  58794  60869  64665  71544

hour               10  ...     15     16     17     18     19     20     21  \
YEAR MONTH DAY         ...
2017 1     1    49572  ...  49213  49357  50362  53115  55205  55437  55348
           2    70869  ...  72228  71945  72641  73387  72294  69989  67893
           3    75999  ...  75576  75168  75791  75922  75469  73118  70769
           4    76175  ...  74977  74275  74909  75344  74504  71957  69715
           5    66806  ...  64767  63613  63095  63230  64253  63353  62455
           6    55679  ...  55408  55256  56000  58322  60456  60310  60173
           7    75383  ...  73064  72466  73274  73844  73287  71062  68628

hour               22     23     24
YEAR MONTH DAY
2017 1     1    55790  58195  59330
           2    66504  67435  69275
           3    68726  69593  71346
           4    68155  68948  70834
           5    62314  64350  66687
           6    60224  62288  63214
           7    66861  67697  69219

[7 rows x 24 columns]

In [139]:
df3 = pd.DataFrame(dict(cat1 = ["A", "A", "B", "B", "B"],
                       cat2 = [1,2,1,2,3], value = [100, 200, 300, 400, 500]))
df3

  cat1  cat2  value
0    A     1    100
1    A     2    200
2    B     1    300
3    B     2    400
4    B     3    500

In [140]:
df3.pivot_table(index="cat1", columns="cat2", values="value")

cat2      1      2      3
cat1
A     100.0  200.0    NaN
B     300.0  400.0  500.0